[
     {
          "id": 0,
          "link": "reffett-associates-assists-afrl",
          "article": {
               "title": "Reffett Associates Assists the Air Force Research Laboratory with Successful Placement of Senior Scientist for High Fidelity Weapons Modeling and Simulation",
               "section": [
                    {
                         "sectionTitle": "",
                         "paragraphs": [
                              "Following a nationwide search, executive recruiting firm Reffett Associates assisted the Air Force Research Laboratory in placing Dr. Craig M. Ewing as the Senior Scientist for High Fidelity Weapons Modeling and Simulation in the Munitions Directorate located at Eglin Air Force Base, Florida. The search was led by Dr. Eric Reffett, Managing Director of the firm’s Washington DC office, with assistance from Marshall Reffett, Managing Director in the firm’s Seattle office.",
                              "Dr. Ewing will serve as the principal scientific authority for the research, development, and implementation of multi-physics, high fidelity modeling and simulation capability, and integration into higher level campaign level simulations to meet future AF weapons and warfighter needs. As Senior Scientist, he will advance the technology for advanced weapons modeling and simulation to improve the Air Force's conventional air-launched munitions capabilities. In this role, Dr. Ewing will initiate, plan, coordinate, evaluate, and conduct research and development that addresses the Air Force's most important Weapons Modeling and Simulation priorities for future AF weapons needs.",
                              "The Senior Scientist is the authoritative scientific technical counsel and advisor to AFRL senior management on all aspects of the science and application of high-fidelity weapons modeling and simulation. In this role, Dr. Ewing will integrate scientific advances with the technical state-of the-art and military technology requirements, and assist the Directors in reviewing and designing an overall Science &Technology program.",
                              "Dr. Ewing has previously served in a number of roles within AFRL. Most recently, he served as Core Technical Competency lead. As CTC lead he supported 115 engineers and technicians providing leadership, strategic planning, and overall technical support for the research, development, integration, and implementation of all levels of Modeling, Simulation, and Analysis (MS&A). This support included high fidelity physics based capabilities, engagement, mission, campaign, and wargaming level simulations. Dr. Ewing holds a PhD and MS in Engineering from the University of Florida and completed his undergraduate studies in Aerospace and Astronautical Engineering from Ohio State University."
                         ]
                    },
                    {
                         "sectionTitle": "The Air Force Research Laboratory",
                         "paragraphs": [
                              "The Air Force Research Laboratory (AFRL) is a scientific research organization operated by the US Air Force Materiel Command dedicated to leading the discovery, development, and integration of affordable aerospace warfighting technologies, planning and executing the Air Force science and technology program, and providing warfighting capabilities to United States air, space, and cyberspace forces. It controls the entire Air Force science and technology research budget which was $5 billion in Fiscal Year 2018.",
                              "AFRL is based at Wright Patterson Air Force Base in Dayton, Ohio and accomplishes its mission through nine component Technology Directorates; the Space Vehicles Directorate, the Directed Energy Directorate, the Information Directorate, the Munitions Directorate, the Materials and Manufacturing Directorate, the Sensors Directorate, and Space Vehicles Directorate.  Additionally, AFRL includes the 711 Human Performance Wing, the Air Force Office of Scientific Research, and a Central Staff."
                         ]
                    },
                    {
                         "sectionTitle": "Expert Advisors",
                         "paragraphs": [
                              "Reffett Associates, based in Bellevue, WA, is a nationally recognized executive search firm. The boutique talent provider has extensive experience in retail and consumer packaged goods, private equity, commercial & federal services, government sectors, and associations and non-profits. Its team is made up of executives with tangible industry experience, possessing real world, relatable knowledge about the challenges executives face in managing talent in a competitive marketplace.",
                              "Dr. Eric Reffett joined the firm after working for Booz Allen Hamilton and serving for over 20 years in the United States Air Force. He specializes in identifying and recruiting highly technical talent for a variety of Government clients.",
                              "Marshall Reffett is a ten-year veteran of the executive search industry. He has successfully led search assignments for senior executives in the retail and consumer packaged goods, private equity, technology, and commercial & federal services industries. Previously, he worked on Capitol Hill for a Member of the House Ways and Means Committee."
                         ]
                    }
               ]
          }
     },
     {
          "id": 1,
          "link": "reffett-associates-places-new-CFO",
          "article": {
               "title": "Reffett Associates Places Chief Financial Officer for Big Horns Enterprises, LLC",
               "section": [
                    {
                         "sectionTitle": "",
                         "paragraphs": [
                              "Executive search firm, Reffett Associates, has placed John Bellamy as Chief Financial Officer for Big Horns Enterprises, LLC. The search was led by Managing Director Marshall Reffett, and Director of Operations, Thomas Young.",
                              "Big Horns Enterprises is a private investment company owned by Kevin Turner, formerly the COO of Microsoft and CIO of Walmart. Big Horns operates several major strategies nationally including 18 Orangetheory Fitness studios in the greater Seattle area, four REMAX locations in Mississippi and Tennessee, and Motto Mortgage in Mississippi, Tennessee, and Texas.",
                              "John has over 20 years of senior level finance experience with large companies with multiple locations such as Sears, General Motors, Blue Cross/Blue Shield, and Eddie Bauer. John understands multiple location and strategy financial management and is experienced in managing fast paced businesses. He is a continual learner, thrives on new challenges, and sets high expectations of himself and his team. He evaluates performance and looks for opportunities to improve the financial health of the business.",
                              "Most recently, John was a Director of Finance at Eddie Bauer. He received his B.S. at Wayne State University and his MBA at Michigan State University."
                         ]
                    },
                    {
                         "sectionTitle": "Reffett Associates",
                         "paragraphs": [
                              "Reffett Associates, based in Bellevue, WA, is a nationally recognized executive search firm. The boutique talent provider has extensive experience in retail and consumer packaged goods, private equity, commercial & federal services, government sectors, and associations and non-profits. Its team is made up of executives with tangible industry experience, possessing real world, relatable knowledge about the challenges executives face in managing talent in a competitive marketplace."
                         ]
                    }
               ]
          }
     },
     {
          "id": 2,
          "link": "reffett-associates-assists-Metropolitan-Market",
          "article": {
               "title": "Reffett Associates assists Metropolitan Market in placing Director, Hospitality and Guest Experiences, an innovative new position",
               "section": [
                    {
                         "sectionTitle": "",
                         "paragraphs": [
                              "Reffett Associates has assisted Metropolitan Markets in placing Patrick Supplee as Director of Hospitality and Guest Experience. In his new role, Patrick will be responsible for continuing to expand the role of Metropolitan Market as the preeminent destination for guests seeking an unparalleled food experience. His focus will be on transmitting the company’s commitment and passion for delivering customer excellence through shared food experiences. His primary mission will be creating a sense of “family” for guests, and embedding those values throughout the organization, while demonstrating them both internally and to the community.",
                              "As a leading specialty food retailer, Metropolitan Market was founded on the principles of pursuing excellence in food, believing that every day is a cause for celebrating “hunting” and “gathering”, hunting for incredible food, and gathering with family and friends. They have been the locus of many “firsts” such as introducing Copper River salmon to Seattle over 30 years ago.",
                              "The search was conducted by Sam Mayberry, who leads the firm’s Supply Chain practice. Sam is located in the Seattle office and was assisted by Bill Reffett, Managing Partner and Marshall Reffett, Managing Director.",
                              "Prior to joining Metropolitan Market, Patrick was employed by the Grand Wailea, a Waldorf Astoria Resort located in Kihei, HI. His major responsibilities included the Napua Club and VIP Guest Services. The Napua Club is a 100 room/ suite luxury guest experience located within the resort.",
                              "Metropolitan Markets has been a leading innovator in food and food experiences for over 5-decades in the Seattle marketplace. Operating 8 stores in neighborhoods across the Seattle / Tacoma metro area, Metropolitan Markets is the place where people come to taste the ripest fruits, the rarest cheeses and the freshest seafood and dairy products in a comfortable, convenient, inspiring environment.",
                              "Reffett Associates is a nationally recognized, retained executive search practice founded on the underlying principle that all productive relationships must be built on trust. Our level of professionalism and experience is invaluable - we believe that it makes the difference between a search that fills a slot and one that moves your organization closer to fulfilling its goals. Offices in the metropolitan areas surrounding Seattle, WA; Washington, DC; Metro, NY; and Dallas, TX."
                         ]
                    }
               ]
          }
     }
]