[
  {
    "srcImg": "/images/About/government.jpg",
    "altText": "Government Contracting & Professional Services",
    "serviceArea": "Government",
    "url": "government-professional-services",
    "description": "With experience at all levels of Federal Government contracting and broad experience in working with the top Federal, State and Local Government service...",
    "clients": [
      {
        "name": "AFRL",
        "image": "/images/Services/Government/AFRL.jpg"
      },
      {
        "name": "City of Charlotte",
        "image": "/images/Services/Government/City of Charlotte.png"
      },
      {
        "name": "City of Seattle",
        "image": "/images/Services/Government/City of Seattle.jpg"
      },
      {
        "name": "Community Transit",
        "image": "/images/Services/Government/Community Transit.jpg"
      },
      {
        "name": "FirstNet",
        "image": "/images/Services/Government/FirstNet.png"
      },
      {
        "name": "Naval Postgraduate School",
        "image": "/images/Services/Government/Naval Postgraduate School.png"
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": "/images/Services/Government/Northwest Seaport.png"
      },
      {
        "name": "Sound Transit",
        "image": "/images/Services/Government/Sound Transit.png"
      }
    ],
    "subtitle": "Success in today's Federal, State and Local Government markets requires leaders and executives who understand this rapidly changing marketplace.  Our group of Managing Directors has a deep understanding of your needs, and how to navigate the intricacies of doing business with the government. \n\n With experience at all levels of Federal Government contracting and broad experience in working with the top Federal, State and Local Government service providers, we understand the unique requirements for senior leaders and executives with experience in government contracting and program management.  This includes contractors performing work overseas and in combat zones in support of US Forces. \n\n Our experience encompasses the entire Federal Government, and a majority of the top 100 Federal contractors.",
    "subtitleList": []
  },
  {
    "srcImg": "/images/About/retailbig.jpg",
    "altText": "Retail",
    "serviceArea": "Retail",
    "url": "retail",
    "description": "We have assisted companies in all areas of the Retail / Consumer world, such as traditional department stores, specialty retail companies, business to consumer, and online retailing...",
    "clients": [
      {
        "name": "AFRL",
        "image": ""
      },
      {
        "name": "City of Charlotte",
        "image": ""
      },
      {
        "name": "City of Seattle",
        "image": ""
      },
      {
        "name": "Community Transit",
        "image": ""
      },
      {
        "name": "FirstNet",
        "image": ""
      },
      {
        "name": "Naval Postgraduate School",
        "image": ""
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": ""
      },
      {
        "name": "Sound Transit",
        "image": ""
      }
    ],
    "subtitle": "We understand the challenges that you face, and what is needed to drive success. In today’s omni-channel retail world, leaders must be knowledgeable and versatile. This is not an environment for the timid. \n\n Our Managing Directors were selected based on their expertise in key leadership roles in the industries they serve. Our Retail / Consumer team is composed of senior executives who have been on “your side” of the desk. They understand the importance of identifying superior leaders and recruiting them to the organization. The search firm you select must have the same sense of urgency displayed by your organization – timeliness is essential to effective candidate placement. \n\n We have assisted companies in all areas of the Retail / Consumer world, such as traditional department stores, specialty retail companies, business to consumer, and on-line retailing. Each search engagement is specifically tailored to the needs of the client and is personally conducted by a Managing Director – from the beginning to its successful conclusion.",
    "subtitleList": []
  },
  {
    "srcImg": "/images/About/publicsectorbig.jpg",
    "altText": "Public Sector",
    "serviceArea": "Public Sector",
    "url": "public-sector",
    "description": "With experience ranging from holding senior level positions in the Office of Personnel Management, Department of Defense, and Capitol Hill, they are experienced in the issues that you confront and the government hiring process...",
    "clients": [
      {
        "name": "AFRL",
        "image": ""
      },
      {
        "name": "City of Charlotte",
        "image": ""
      },
      {
        "name": "City of Seattle",
        "image": ""
      },
      {
        "name": "Community Transit",
        "image": ""
      },
      {
        "name": "FirstNet",
        "image": ""
      },
      {
        "name": "Naval Postgraduate School",
        "image": ""
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": ""
      },
      {
        "name": "Sound Transit",
        "image": ""
      }
    ],
    "subtitle": "As a leading provider of retained executive search services to the federal government, we possess a unique understanding of your needs. Our group of Managing Directors bring with them unparalleled experience in the public sector. With experience ranging from holding senior level positions in the Office of Personnel Management, Department of Defense, on Capitol Hill, they are experienced in the government hiring process and the issues that you confront. \n\n Reffett Associates is a veteran-owned business and maintains a GSA contract (GS-02F-0194W). We are one of the few executive search firms to be awarded this prestigious qualification after completing their extensive qualification process. In addition, we are members of the National Defense Industrial Association, the Professional Services Council, and the Pacific Northwest Defense Coalition.",
    "subtitleList": []
  },
  {
    "srcImg": "/images/About/privateequitybig.jpg",
    "altText": "Private Equity & Financial Services",
    "serviceArea": "Private Equity & Financial Services",
    "url": "private-equity",
    "description": "As market conditions have changed, Private Equity has become a greater part of our firm’s practice. We understand the talents and skills required to lead companies through all the stages of their life cycle...",
    "clients": [
      {
        "name": "AFRL",
        "image": ""
      },
      {
        "name": "City of Charlotte",
        "image": ""
      },
      {
        "name": "City of Seattle",
        "image": ""
      },
      {
        "name": "Community Transit",
        "image": ""
      },
      {
        "name": "FirstNet",
        "image": ""
      },
      {
        "name": "Naval Postgraduate School",
        "image": ""
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": ""
      },
      {
        "name": "Sound Transit",
        "image": ""
      }
    ],
    "subtitle": "As market conditions have changed, Private Equity has become a greater part of our firm’s practice. We understand the talents and skills required to lead companies through all the stages of the life cycle, from the earliest stage start-up, to upgrading the management team of a portfolio company. \n\n Our firm has assisted major Private Equity firms in all stages of their evaluation process:",
    "subtitleList": ["On a consulting basis, using our extensive network to help provide overall market intelligence, current talent evaluation, and company position", "Performing pre-investment evaluation on a company’s existing human capital, their leadership, and overall culture", "Identifying and recruiting executives at all company levels, who can quickly provide the value added to transform the portfolio company performance", "Determining long range talent resources, both internal and external to the company."]
  },
  {
    "srcImg": "/images/About/manufactoringbig.jpg",
    "altText": "Manufacturing & Industrials",
    "serviceArea": "Manufacturing & Industrials",
    "url": "manufacturing-industrials",
    "description": "Success means leveraging external partners such as Reffett Associates to identify and attract exceptional talent that can make a significant business impact...",
    "clients": [
      {
        "name": "AFRL",
        "image": ""
      },
      {
        "name": "City of Charlotte",
        "image": ""
      },
      {
        "name": "City of Seattle",
        "image": ""
      },
      {
        "name": "Community Transit",
        "image": ""
      },
      {
        "name": "FirstNet",
        "image": ""
      },
      {
        "name": "Naval Postgraduate School",
        "image": ""
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": ""
      },
      {
        "name": "Sound Transit",
        "image": ""
      }
    ],
    "subtitle": "Success in today’s market requires leaders and executives who understand the nature of its rapidly changing landscape.  Often this means leveraging external partners such as Reffett Associates to identify and attract exceptional talent that can make a significant business impact. \n\n The Reffett Associates team is uniquely positioned to understand our clients’ needs.  Having served as senior executives in major professional services and Fortune 500 companies, we possess deep expertise in providing business solutions to commercial and government clients.  Our insight and consultative approach, combined with access to the best talent, ensures that the results we deliver to clients exceed their expectations.",
    "subtitleList": []
  },
  {
    "srcImg": "/images/About/nonprofitbigpuz.jpg",
    "altText": "Associations & Nonprofits",
    "serviceArea": "Associations & Nonprofits",
    "url": "associations-nonprofit",
    "description": "Outstanding leadership skills are developed over a lifetime of great opportunities and experiences.  We are intimately familiar with the challenges you face every day...",
    "clients": [
      {
        "name": "AFRL",
        "image": ""
      },
      {
        "name": "City of Charlotte",
        "image": ""
      },
      {
        "name": "City of Seattle",
        "image": ""
      },
      {
        "name": "Community Transit",
        "image": ""
      },
      {
        "name": "FirstNet",
        "image": ""
      },
      {
        "name": "Naval Postgraduate School",
        "image": ""
      },
      {
        "name": "Northwest Seaport Alliance",
        "image": ""
      },
      {
        "name": "Sound Transit",
        "image": ""
      }
    ],
    "subtitle": "Outstanding leadership skills are developed over a lifetime of great opportunities and experiences.  We are intimately familiar with association and not-for-profit organizations and the challenges they face every day. \n\n We are especially well qualified to identify that unique person to fit your organization’s needs.  As not-for-profit organizations begin operating more like businesses and implementing best practices and governance structures, effective leadership at the top is imperative.  Reffett Associates will find the individuals who best fit your organization and will work towards the achievement of your organization’s mission. \n\n Our experience encompasses the entire Federal Government, and a majority of the top 100 Federal contractors.",
    "subtitleList": []
  }
]